/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   char_struct_to_hex.c                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: swarner <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/07 15:31:34 by swarner           #+#    #+#             */
/*   Updated: 2019/12/07 15:31:37 by swarner          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#define 00  0000 0000
#define 01  0000 0001
        02  0000 0010
        03  0000 0011
            0000 0100
            0000 0101
            0000 0110
            0000 0111
            0000 1000
            0000 1001
            0000 1010
            0000 1011
            0000 1100
            0000 1101
            0000 1110
        0F  0000 1111

        10  0001 0000
            0010 0000
            0011 0000
            0100 0000
            0101 0000
            0110 0000
            0111 0000
            1000 0000
            1001 0000
            1010 0000
            1011 0000
            1100 0000
            1101 0000
            1110 0000
        F0  1111 0000
        
        Char *str = "010000000f";
        int len = ft_strlen(str) / 2; //10/2 = 5
        unsingned char *byte_code[len]; //5 элементов
        int i = 0;
        while (i < len)
        {
            while (перебираем 15 символов для первой буквы байта)
            {
                if(str[i*2]=='символ0-f')
                    byte_code[i]|= код_первой_буквы;
            }
            while (перебираем 15 символов для второй буквы байта)
            {
                if(str[i*2+1]=='символ0-f')
                  byte_code[i]|= код_второй_буквы;
            }
            i++;
        }
